Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J19.PIC
      <edc:SFRDef edc:_addr="0x40018028" edc:access="----------wwww-w----wwwwwwww-www" edc:cname="TWIHS0_IDR" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001802C" edc:access="----------rrrr-r----rrrrrrrr-rrr" edc:cname="TWIHS0_IMR" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018030" edc:access="------------------------rrrrrrrr" edc:cname="TWIHS0_RHR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Master or Slave Receive Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018034" edc:access="------------------------wwwwwwww" edc:cname="TWIHS0_THR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Master or Slave Transmit Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn----nnnn" edc:cname="TWIHS0_SMBTR" edc:impl="0xFFFFFF0F" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="SMBus Clock Prescaler" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TLOWS" edc:desc="Slave Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TLOWM" edc:desc="Master Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="THMAX" edc:desc="Clock High Maximum Cycles" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001803C" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40018044" edc:access="---------------------nnn-----nnn" edc:cname="TWIHS0_FILTR" edc:impl="0x707" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="FILT" edc:desc="RX Digital Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADFEN" edc:desc="PAD Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADFCFG" edc:desc="PAD Filter Config" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="THRES" edc:desc="Digital Filter Threshold" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40018048" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4001804C" edc:access="nnnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="TWIHS0_SWMR" edc:impl="0xFF7F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="SADR1" edc:desc="Slave Address 1" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2" edc:desc="Slave Address 2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3" edc:desc="Slave Address 3" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAM" edc:desc="Data Match" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40018050" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x400180D0" edc:access="----------------------------rrrr" edc:cname="TWIHS0_DR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="SWEN" edc:desc="SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRQ" edc:desc="Clock Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWMATCH" edc:desc="SleepWalking Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP" edc:desc="Transfer Pending" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400180D4" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400180E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TWIHS0_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x545749"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400180E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:cname="TWIHS0_WPSR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400180EC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400180FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="TWIHS0_VER" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40018100" edc:offset="0x3F00"/>
      <edc:SFRDef edc:_addr="0x4001C000" edc:access="--ww-w-w------wwwwwwwwwwwwwwwwww" edc:cname="TWIHS1_CR" edc:impl="0x3503FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Send a START Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Send a STOP Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSEN" edc:desc="TWIHS Master Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSDIS" edc:desc="TWIHS Master Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVEN" edc:desc="TWIHS Slave Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVDIS" edc:desc="TWIHS Slave Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUICK" edc:desc="SMBus Quick Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="TWIHS High-Speed Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSDIS" edc:desc="TWIHS High-Speed Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBEN" edc:desc="SMBus Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDIS" edc:desc="SMBus Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECEN" edc:desc="Packet Error Checking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECDIS" edc:desc="Packet Error Checking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECRQ" edc:desc="PEC Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Bus CLEAR Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMEN" edc:desc="Alternative Command Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMDIS" edc:desc="Alternative Command Mode Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="THRCLR" edc:desc="Transmit Holding Register Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKCLR" edc:desc="Lock Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:desc="FIFO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:desc="FIFO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C004" edc:access="---------nnnnnnn---n--nn--------" edc:cname="TWIHS1_MMR" edc:impl="0x7F1300" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:desc="Internal Device Address Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:desc="Master Read Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:desc="Device Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C008" edc:access="nnnn-----nnnnnnn-nnnnnnn-n--nn-n" edc:cname="TWIHS1_SMR" edc:impl="0xF07F7F4D" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="NACKEN" edc:desc="Slave Receiver Data Phase NACK enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMDA" edc:desc="SMBus Default Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMHH" edc:desc="SMBus Host Header" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCLWSDIS" edc:desc="Clock Wait State Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Slave Address Mask" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:desc="Slave Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SADR1EN" edc:desc="Slave Address 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2EN" edc:desc="Slave Address 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3EN" edc:desc="Slave Address 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAMEN" edc:desc="Data Matching Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C00C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWIHS1_IADR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="IADR" edc:desc="Internal Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C010" edc:access="--nnnnnn-----nnnnnnnnnnnnnnnnnnn" edc:cname="TWIHS1_CWGR" edc:impl="0x3F07FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:desc="Clock Low Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:desc="Clock High Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:desc="Clock Divider" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="TWD Hold Time Versus TWCK Falling" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C014" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4001C020" edc:access="------rr--rrrr-r----rrrrrrrrrrrr" edc:cname="TWIHS1_SR" edc:impl="0x33D0FFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed (cleared by writing TWIHS_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready (cleared by reading TWIHS_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready (cleared by writing TWIHS_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:desc="Slave Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledged (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:desc="Clock Wait State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:desc="SCL Line Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:desc="SDA Line Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C024" edc:access="----------wwww-w----wwwwwwww-www" edc:cname="TWIHS1_IER" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
