Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J19.PIC
      <edc:SFRDef edc:_addr="0x4003C068" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="AFEC0_CDR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Converted Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C06C" edc:access="----------------------nnnnnnnnnn" edc:cname="AFEC0_COCR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="AOFF" edc:desc="Analog Offset" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C070" edc:access="--------------------------nn---n" edc:cname="AFEC0_TEMPMR" edc:impl="0x31" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="RTCT" edc:desc="Temperature Sensor RTC Trigger Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:desc="Temperature Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_TEMPCWR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:desc="Temperature Low Threshold" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:desc="Temperature High Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C078" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x4003C094" edc:access="----------------------nn----nn--" edc:cname="AFEC0_ACR" edc:impl="0x30C" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:desc="PGA0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:desc="PGA1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:desc="AFE Bias Current Control" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C098" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0A0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_SHMR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:desc="Dual Sample &amp; Hold for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:desc="Dual Sample &amp; Hold for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:desc="Dual Sample &amp; Hold for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:desc="Dual Sample &amp; Hold for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:desc="Dual Sample &amp; Hold for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:desc="Dual Sample &amp; Hold for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:desc="Dual Sample &amp; Hold for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:desc="Dual Sample &amp; Hold for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:desc="Dual Sample &amp; Hold for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:desc="Dual Sample &amp; Hold for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:desc="Dual Sample &amp; Hold for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:desc="Dual Sample &amp; Hold for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0A4" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x4003C0D0" edc:access="-------------------------------n" edc:cname="AFEC0_COSR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Sample &amp; Hold unit Correction Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_CVR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D8" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_CECR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:desc="Error Correction Enable for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:desc="Error Correction Enable for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:desc="Error Correction Enable for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:desc="Error Correction Enable for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:desc="Error Correction Enable for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:desc="Error Correction Enable for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:desc="Error Correction Enable for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:desc="Error Correction Enable for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:desc="Error Correction Enable for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:desc="Error Correction Enable for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:desc="Error Correction Enable for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:desc="Error Correction Enable for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="AFEC0_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect KEY" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="AFEC0_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protect Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protect Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0EC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4003C0FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="AFEC0_VERSION" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C100" edc:offset="0x7F00"/>
      <edc:SFRDef edc:_addr="0x40044000" edc:access="-------------------------------w" edc:cname="ACC_CR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044004" edc:access="-----------------nnn-nnn-nnn-nnn" edc:cname="ACC_MR" edc:impl="0x7777" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="SELMINUS" edc:desc="Selection for Minus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TS" edc:desc="Select TS" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="Select VREFP" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="Select DAC0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DAC1" edc:desc="Select DAC1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELPLUS" edc:desc="Selection For Plus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD4" edc:desc="Select AFE0_AD4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD5" edc:desc="Select AFE0_AD5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD0" edc:desc="Select AFE1_AD0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD1" edc:desc="Select AFE1_AD1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="Analog Comparator Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGETYP" edc:desc="Edge Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Only rising edge of comparator output" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of comparator output" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ANY" edc:desc="Any edge of comparator output" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INV" edc:desc="Invert Comparator Output" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator output is directly processed." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator output is inverted prior to being processed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELFS" edc:desc="Selection Of Fault Source" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CE" edc:desc="The CE flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTPUT" edc:desc="The output of the analog comparator flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Fault Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The FAULT output is tied to 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The FAULT output is driven by the signal defined by SELFS." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044008" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40044024" edc:access="-------------------------------w" edc:cname="ACC_IER" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044028" edc:access="-------------------------------w" edc:cname="ACC_IDR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004402C" edc:access="-------------------------------r" edc:cname="ACC_IMR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044030" edc:access="r-----------------------------rr" edc:cname="ACC_ISR" edc:impl="0x80000003" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCO" edc:desc="Synchronized Comparator Output" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Flag Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
