Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J19.PIC
      <edc:SFRDef edc:_addr="0x400504C0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_CBSISQA" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="IS" edc:desc="IdleSlope" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400504C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_CBSISQB" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="IS" edc:desc="IdleSlope" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400504C8" edc:offset="0x38"/>
      <edc:SFRDef edc:_addr="0x40050500" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ0" edc:impl="0x3FFFFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050504" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ1" edc:impl="0x3FFFFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050508" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ2" edc:impl="0x3FFFFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005050C" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:cname="GMAC_ST1RPQ3" edc:impl="0x3FFFFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTCM" edc:desc="Differentiated Services or Traffic Class Match" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="UDPM" edc:desc="UDP Port Match" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DSTCE" edc:desc="Differentiated Services or Traffic Class Match Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDPE" edc:desc="UDP Port Match Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050510" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x40050540" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ0" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050544" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ1" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050548" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ2" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005054C" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ3" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050550" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ4" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050554" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ5" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050558" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ6" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005055C" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ7" edc:impl="0x7FFFFF77" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
