Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J19.PIC
      <edc:SFRDef edc:_addr="0x400E066C" edc:access="----------r--rrr-rrrrrrr-r--r-rr" edc:cname="PMC_IMR" edc:impl="0x277F4B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0670" edc:access="--------nnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="PMC_FSMR" edc:impl="0xF7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:desc="Fast Startup Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:desc="Fast Startup Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:desc="Fast Startup Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:desc="Fast Startup Input Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:desc="Fast Startup Input Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:desc="Fast Startup Input Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:desc="Fast Startup Input Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:desc="Fast Startup Input Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:desc="Fast Startup Input Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:desc="Fast Startup Input Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:desc="Fast Startup Input Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:desc="Fast Startup Input Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:desc="Fast Startup Input Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:desc="Fast Startup Input Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:desc="Fast Startup Input Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:desc="Fast Startup Input Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:desc="RTT Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:desc="RTC Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBAL" edc:desc="USB Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:desc="Low-power Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:desc="Flash Low-power Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:desc="Force Flash Low-power Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0674" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMC_FSPR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:desc="Fast Startup Input Polarity 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:desc="Fast Startup Input Polarity 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:desc="Fast Startup Input Polarity 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:desc="Fast Startup Input Polarity 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:desc="Fast Startup Input Polarity 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:desc="Fast Startup Input Polarity 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:desc="Fast Startup Input Polarity 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:desc="Fast Startup Input Polarity 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:desc="Fast Startup Input Polarity 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:desc="Fast Startup Input Polarity 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:desc="Fast Startup Input Polarity 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:desc="Fast Startup Input Polarity 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:desc="Fast Startup Input Polarity 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:desc="Fast Startup Input Polarity 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:desc="Fast Startup Input Polarity 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:desc="Fast Startup Input Polarity 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0678" edc:access="-------------------------------w" edc:cname="PMC_FOCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:desc="Fault Output Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E067C" edc:offset="0x68"/>
      <edc:SFRDef edc:_addr="0x400E06E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PMC_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E06E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="PMC_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E06EC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400E06FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="PMC_VERSION" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0700" edc:access="---wwwww--wwwwwwwwwwwwwww-w-wwww" edc:cname="PMC_PCER1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral Clock 32 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral Clock 33 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral Clock 34 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral Clock 35 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral Clock 37 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral Clock 39 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral Clock 40 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral Clock 41 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral Clock 42 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral Clock 43 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral Clock 44 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral Clock 45 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral Clock 46 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral Clock 50 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral Clock 51 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral Clock 52 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral Clock 53 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral Clock 56 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral Clock 57 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral Clock 58 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral Clock 59 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral Clock 60 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
