Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MLBSIG" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
